ROHMUSDC/ROHM_SensorPlatform_Multi-Sensor-Shield/Platform Code/Nordic_nRF51-DK_FirmwareExample/main.cpp
            i2c.write(RPR0521_addr_w, &RPR0521_Addr_ReadData, 1, RepStart);
            i2c.read(RPR0521_addr_r, &RPR0521_Content_ReadData[0], 6, NoRepStart);
            
            RPR0521_PS_RAWOUT = (RPR0521_Content_ReadData[1]<<8) | (RPR0521_Content_ReadData[0]);
            RPR0521_ALS_D0_RAWOUT = (RPR0521_Content_ReadData[3]<<8) | (RPR0521_Content_ReadData[2]);
            RPR0521_ALS_D1_RAWOUT = (RPR0521_Content_ReadData[5]<<8) | (RPR0521_Content_ReadData[4]);
            RPR0521_ALS_DataRatio = (float)RPR0521_ALS_D1_RAWOUT / (float)RPR0521_ALS_D0_RAWOUT;
             
            if(RPR0521_ALS_DataRatio < 0.595){
                RPR0521_ALS_OUT = (1.682*(float)RPR0521_ALS_D0_RAWOUT - 1.877*(float)RPR0521_ALS_D1_RAWOUT);
            }
            else if(RPR0521_ALS_DataRatio < 1.015){
                RPR0521_ALS_OUT = (0.644*(float)RPR0521_ALS_D0_RAWOUT - 0.132*(float)RPR0521_ALS_D1_RAWOUT);
            }
            else if(RPR0521_ALS_DataRatio < 1.352){
                RPR0521_ALS_OUT = (0.756*(float)RPR0521_ALS_D0_RAWOUT - 0.243*(float)RPR0521_ALS_D1_RAWOUT);
            }
            else if(RPR0521_ALS_DataRatio < 3.053){
                RPR0521_ALS_OUT = (0.766*(float)RPR0521_ALS_D0_RAWOUT - 0.25*(float)RPR0521_ALS_D1_RAWOUT);
            }
            else{
                RPR0521_ALS_OUT = 0;
            }
            
            len = snprintf((char*) buf, MAX_REPLY_LEN, "ALS/PROX:");
            m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
            wait_ms(20); 
            
            len = snprintf((char*) buf, MAX_REPLY_LEN, "  ALS= %0.2f lx", RPR0521_ALS_OUT);
            m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
            wait_ms(20); 
            
            len = snprintf((char*) buf, MAX_REPLY_LEN, "  PS= %u ADC", RPR0521_PS_RAWOUT);
            m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
            wait_ms(20);        
        }
        #endif
        i++;
    }
    else if(i == 6){
        #ifdef KMX62
        if (m_ble.getGapState().connected) {
            //Read Accel Portion from the IC
            i2c.write(KMX62_addr_w, &KMX62_Addr_Accel_ReadData, 1, RepStart);
            i2c.read(KMX62_addr_r, &KMX62_Content_Accel_ReadData[0], 6, NoRepStart);

            //Note: The highbyte and low byte return a 14bit value, dropping the two LSB in the Low byte.
            //      However, because we need the signed value, we will adjust the value when converting to "g"
            MEMS_Accel_Xout = (KMX62_Content_Accel_ReadData[1]<<8) | (KMX62_Content_Accel_ReadData[0]);
            MEMS_Accel_Yout = (KMX62_Content_Accel_ReadData[3]<<8) | (KMX62_Content_Accel_ReadData[2]);
            MEMS_Accel_Zout = (KMX62_Content_Accel_ReadData[5]<<8) | (KMX62_Content_Accel_ReadData[4]);
              
            //Note: Conversion to G is as follows:
            //      Axis_ValueInG = MEMS_Accel_axis / 1024
            //      However, since we did not remove the LSB previously, we need to divide by 4 again
            //      Thus, we will divide the output by 4096 (1024*4) to convert and cancel out the LSB
            MEMS_Accel_Conv_Xout = ((float)MEMS_Accel_Xout/4096/2);
            MEMS_Accel_Conv_Yout = ((float)MEMS_Accel_Yout/4096/2);
            MEMS_Accel_Conv_Zout = ((float)MEMS_Accel_Zout/4096/2);

            //Read MAg portion from the IC
            i2c.write(KMX62_addr_w, &KMX62_Addr_Mag_ReadData, 1, RepStart);
            i2c.read(KMX62_addr_r, &KMX62_Content_Mag_ReadData[0], 6, NoRepStart);

            //Note: The highbyte and low byte return a 14bit value, dropping the two LSB in the Low byte.
            //      However, because we need the signed value, we will adjust the value when converting to "g"
            MEMS_Mag_Xout = (KMX62_Content_Mag_ReadData[1]<<8) | (KMX62_Content_Mag_ReadData[0]);
            MEMS_Mag_Yout = (KMX62_Content_Mag_ReadData[3]<<8) | (KMX62_Content_Mag_ReadData[2]);
            MEMS_Mag_Zout = (KMX62_Content_Mag_ReadData[5]<<8) | (KMX62_Content_Mag_ReadData[4]);
            
            //Note: Conversion to G is as follows:
            //      Axis_ValueInG = MEMS_Accel_axis / 1024
            //      However, since we did not remove the LSB previously, we need to divide by 4 again
            //      Thus, we will divide the output by 4095 (1024*4) to convert and cancel out the LSB
            MEMS_Mag_Conv_Xout = (float)MEMS_Mag_Xout/4096*0.146;
            MEMS_Mag_Conv_Yout = (float)MEMS_Mag_Yout/4096*0.146;
            MEMS_Mag_Conv_Zout = (float)MEMS_Mag_Zout/4096*0.146; 

            // transmit data
            

            len = snprintf((char*) buf, MAX_REPLY_LEN, "KMX61SensorData:");
            m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
            wait_ms(20);

            len = snprintf((char*) buf, MAX_REPLY_LEN, "  AccX= %0.2f g", MEMS_Accel_Conv_Xout);
            m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
            wait_ms(20);
            
            len = snprintf((char*) buf, MAX_REPLY_LEN, "  AccY= %0.2f g", MEMS_Accel_Conv_Yout);
            m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
            wait_ms(20);
            
            len = snprintf((char*) buf, MAX_REPLY_LEN, "  AccZ= %0.2f g", MEMS_Accel_Conv_Zout);
            m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
            wait_ms(20);
            
            len = snprintf((char*) buf, MAX_REPLY_LEN, "  MagX= %0.2f uT", MEMS_Mag_Conv_Xout);
            m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
            wait_ms(20);
            
            len = snprintf((char*) buf, MAX_REPLY_LEN, "  MagY= %0.2f uT", MEMS_Mag_Conv_Yout);
            m_ble.updateCharacteristicValue(m_uart_service_ptr->getRXCharacteristicHandle(), buf, len);
            wait_ms(20);
            
